app/controllers/companies_controller.rb

  def index
    @companies = Company.alphabetical.all
---
SELECT "companies".* FROM "companies" ORDER BY name